---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsComponentConnection.ConnectionType
source: html/c711b1d5-866f-2d51-0c5d-df5ec94c5aec.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnection.ConnectionType Property

The connection type of the connected stairs component.

## Syntax (C#)
```csharp
public StairsComponentConnectionEndType ConnectionType { get; }
```